VPro/src/ChartsOfCharacteristicTypes/AdditionalAttributesAndInformation/AdditionalAttributesAndInformation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>AdditionalAttributesAndInformation</name>
  <type>
    <types>CatalogRef.Currencies</types>
    <types>CatalogRef.ObjectsPropertiesValues</types>
    <types>CatalogRef.ProductsAndServices</types>
    <types>CatalogRef.ObjectsPropertiesValuesHierarchy</types>
    <types>Boolean</types>
    <types>CatalogRef.Individuals</types>
    <types>String</types>
    <types>CatalogRef.Users</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.Counterparties</types>
    <types>CatalogRef.Projects</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
    </type>
  </attributes>
  <attributes>
    <name>ThisIsAdditionalInformation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FillObligatory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MultilineTextBox</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesAreUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesOwner</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalValuesWithWeight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ValueFormHeader</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValueChoiceFormHeader</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormatProperties</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ToolTip</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Visible</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DisplayAsHyperlink</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Available</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributeDependencies</name>
    <attributes>
      <name>DependentProperty</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>PropertySet</name>
      <type>
        <types>CatalogRef.AdditionalAttributesAndInformationSets</types>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Presentations</name>
    <attributes>
      <name>LanguageCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ToolTip</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueFormHeader</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValueChoiceFormHeader</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

VPro/src/ChartsOfCharacteristicTypes/AdditionalAttributesAndInformation/Forms/PropertySettingChange/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.ThisIsAdditionalInformation Then
		Items.TypesProperties.CurrentPage = Items.AdditionalInformation;
		Title = NStr("en='Change additional information settings';ru='Изменить настройку дополнительного сведения';vi='Thay đổi tùy chỉnh thông tin bổ sung'");
	Else
		Items.TypesProperties.CurrentPage = Items.AdditionalAttribute;
	EndIf;
	
	If ValueIsFilled(Parameters.AdditionalValuesOwner) Then
		Items.AttributeKinds.CurrentPage = Items.KindCommonAttributesValues;
		Items.KindsOfInformation.CurrentPage  = Items.KindGeneralInformationValues;
		SinglePropertyWithCommonListOfValues = 1;
	Else
		Items.AttributeKinds.CurrentPage = Items.CommonAttributeKind;
		Items.KindsOfInformation.CurrentPage  = Items.CommonInformationKind;
		CommonProperty = 1;
	EndIf;
	
	Property = Parameters.Property;
	CurrentSetOfProperties = Parameters.CurrentSetOfProperties;
	ThisIsAdditionalInformation = Parameters.ThisIsAdditionalInformation;
	
	Items.IndividualValuesAttributeComment.Title =
		StringFunctionsClientServer.SubstituteParametersInString(
			Items.IndividualValuesAttributeComment.Title, CurrentSetOfProperties);
	
	Items.CommonAttributesValuesComment.Title =
		StringFunctionsClientServer.SubstituteParametersInString(
			Items.CommonAttributesValuesComment.Title, CurrentSetOfProperties);
	
	Items.SeparateDataValuesComment.Title =
		StringFunctionsClientServer.SubstituteParametersInString(
			Items.SeparateDataValuesComment.Title, CurrentSetOfProperties);
	
	Items.GeneralInformationValuesComment.Title =
		StringFunctionsClientServer.SubstituteParametersInString(
			Items.GeneralInformationValuesComment.Title, CurrentSetOfProperties);
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, Exit, WarningText, StandardProcessing)
	
	Notification = New NotifyDescription("WriteAndCloseEnd", ThisObject);
	CommonUseClient.ShowFormClosingConfirmation(Notification, Cancel, Exit);
	
EndProcedure

#EndRegion

#Region HeaderFormItemsEventsHandlers

&AtClient
Procedure KindOnChange(Item)
	
	KindAtServerOnChange(Item.Name);
	
EndProcedure

&AtServer
Procedure KindAtServerOnChange(ItemName)
	
	SinglePropertyWithCommonListOfValues = 0;
	SeparatePropertyWithSeparateValuesList = 0;
	CommonProperty = 0;
	
	ThisObject[Items[ItemName].DataPath] = 1;
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure WriteAndClose(Command)
	
	WriteAndCloseEnd();
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtClient
Procedure WriteAndCloseEnd(Result = Undefined, AdditionalParameters = Undefined) Export
	
	If SeparatePropertyWithSeparateValuesList = 1 Then
		WriteBegin();
	Else
		WriteCompletion(Undefined);
	EndIf;
	
EndProcedure

&AtClient
Procedure WriteBegin()
	
	ExecutionResult = WriteAtServer();
	
	If ExecutionResult.Status = "Completed" Then
		OpenProperty = GetFromTempStorage(ExecutionResult.ResultAddress);
		WriteCompletion(OpenProperty);
	Else
		WaitingParameters = LongActionsClient.WaitingParameters(ThisObject);
		CompletionNotification = New NotifyDescription("WriteContinue", ThisObject);
		
		LongActionsClient.WaitForCompletion(ExecutionResult, CompletionNotification, WaitingParameters);
	EndIf;
	
EndProcedure

&AtClient
Procedure WriteContinue(Result, AdditionalParameters) Export
	
	If Result = Undefined Then
		Return;
	EndIf;
	OpenProperty = GetFromTempStorage(Result.ResultAddress);
	
	WriteCompletion(OpenProperty);
EndProcedure

&AtClient
Procedure WriteCompletion(OpenProperty)
	
	Modified = False;
	
	Notify("Writing_AdditionalAttributesAndInformation",
		New Structure("Ref", Property), Property);
	
	Notify("Writing_AdditionalAttributesAndInformationSets",
		New Structure("Ref", CurrentSetOfProperties), CurrentSetOfProperties);
	
	NotifyChoice(OpenProperty);
	
EndProcedure

&AtServer
Function WriteAtServer()
	
	ProcedureParameters = New Structure;
	ProcedureParameters.Insert("Property", Property);
	ProcedureParameters.Insert("CurrentSetOfProperties", CurrentSetOfProperties);
	
	JobDescription = NStr("en='Change additional property setting';ru='Изменение настройки дополнительного свойства';vi='Thay đổi tùy chỉnh thuộc tính bổ sung'");
	ExecuteParameters = LongActions.BackgroundExecutionParameters(UUID);
	ExecuteParameters.WaitForCompletion = 2;
	ExecuteParameters.BackgroundJobDescription = JobDescription;
	
	Result = LongActions.ExecuteInBackground("ChartsOfCharacteristicTypes.AdditionalAttributesAndInformation.ChangePropertiesConfiguration",
		ProcedureParameters, ExecuteParameters);
	
	Return Result;
	
EndFunction

#EndRegion
